In [3]:
import pymysql as mdb
import pandas as pd
con = mdb.connect('localhost', 'root', 'password', 'db1') #host, user, password, #database

In [5]:
schema_dict = {}

with con:
    cur = con.cursor()
    for name in ['employee']:
        cur.execute("SHOW COLUMNS FROM "+name)
        temp_schema = cur.fetchall()
        
        temp_list = []
        for entry in temp_schema:
            temp_list.append(entry[0])
        schema_dict[name] = temp_list
        
for k, v in schema_dict.iteritems():
    print 'columsns in',k,'table:\n', v, '\n'

columsns in employee table:
['emp_id', 'fname', 'lname', 'start_date', 'end_date', 'superior_emp_id', 'dept_id', 'title', 'assigned_branch_id']

In [6]:
def run_query(query):
    df = pd.read_sql_query(query,con)
    print(df)

In [20]:
#To work on Together
#output a list of department ids, department names, and the number of employees in each

In [7]:
query = """
        SELECT *
        FROM employee
        """

In [8]:
run_query(query)

    emp_id     fname      lname  start_date end_date  superior_emp_id  \
0        1   Michael      Smith  2001-06-22     None              NaN
1        2     Susan     Barker  2002-09-12     None              1.0
2        3    Robert      Tyler  2000-02-09     None              1.0
3        4     Susan  Hawthorne  2002-04-24     None              3.0
4        5      John    Gooding  2003-11-14     None              4.0
5        6     Helen    Fleming  2004-03-17     None              4.0
6        7     Chris     Tucker  2004-09-15     None              6.0
7        8     Sarah     Parker  2002-12-02     None              6.0
8        9      Jane   Grossman  2002-05-03     None              6.0
9       10     Paula    Roberts  2002-07-27     None              4.0
10      11    Thomas    Ziegler  2000-10-23     None             10.0
11      12  Samantha    Jameson  2003-01-08     None             10.0
12      13      John      Blake  2000-05-11     None              4.0
13      14     Cindy      Mason  2002-08-09     None             13.0
14      15     Frank    Portman  2003-04-01     None             13.0
15      16   Theresa    Markham  2001-03-15     None              4.0
16      17      Beth     Fowler  2002-06-29     None             16.0
17      18      Rick     Tulman  2002-12-12     None             16.0

    dept_id               title  assigned_branch_id
0         3           President                   1
1         3      Vice President                   1
2         3           Treasurer                   1
3         1  Operations Manager                   1
4         2        Loan Manager                   1
5         1         Head Teller                   1
6         1              Teller                   1
7         1              Teller                   1
8         1              Teller                   1
9         1         Head Teller                   2
10        1              Teller                   2
11        1              Teller                   2
12        1         Head Teller                   3
13        1              Teller                   3
14        1              Teller                   3
15        1         Head Teller                   4
16        1              Teller                   4
17        1              Teller                   4

In [ ]:
#what if you wanted to create  a new set of groups, grouping customers by the total
#amount of money in their deposit accounts?
#How can we create a table with the features "name", low_limit, high_limit using just a select statement?

In [27]:
#now, what if we wanted to count how many customers fall into each group based on their total account balances?

In [9]:
#This answer also checks for a specific product type, hence the extra join on the product table in the first query
query = "SELECT groups.name, COUNT(*) num_customers\
         FROM\
           (SELECT SUM(a.avail_balance) cust_balance\
            FROM account a INNER JOIN product p\
            ON a.product_cd = p.product_cd\
            WHERE p.product_type_cd = 'ACCOUNT'\
            GROUP BY a.cust_id) cust_rollup\
            INNER JOIN\
            (SELECT 'Small Fry' name, 0 low_limit, 4999.99 high_limit \
                 UNION ALL \
                 SELECT 'Average Joes' name, 5000 low_limit, 9999.99 high_limit\
                 UNION ALL\
                 SELECT 'Heavy Hitter' name, 10000 low_limit, 999999 high_limit) groups\
            ON cust_rollup.cust_balance\
                BETWEEN groups.low_limit and groups.high_limit\
          GROUP BY groups.name"

run_query(query)

           name  num_customers
0  Average Joes              2
1  Heavy Hitter              4
2     Small Fry              5